
#-------------------------------------------------
#  スクリプト処理開始、モード切替
#-------------------------------------------------
sub init_start{

# $moto を定義
$moto = $in{'moto'};
if($moto =~ /[^0-9a-z]/){ &error("掲示板の指定が変です。"); }
$realmoto = $moto;
$moto =~ s/^sub//;
if($moto eq ""){ &error("掲示板を指定してください。"); }

}

#-----------------------------------------------------------
# 処理スタート
#-----------------------------------------------------------
sub start{

my($ktag);
our(%in);

if($in{'k'}){ $ktag = "k"; }
if($in{'mode'} eq "memo" && $in{'no'}){
&Mebius::Redirect("","http://aurasoul.mb2.jp/_$moto/${ktag}$in{'no'}_memo.html",301);
}
else{
&error("この投稿用ＵＲＬは、いまは使われていません。");
}

}

1;

